print('Задача 3. Это будет бомба')

# Мы разрабатываем пошаговую игру по мотивам боевика.
# Игрок - главный герой и должен обезвредить бомбу, которая взорвётся через N секунд.
# Программа спрашивает пользователя хочет ли он обезвредить бомбу сейчас.
#
# Если ответ “0” (то есть “нет”), то счетчик бомбы уменьшается.
# Если он достиг нуля, то программа выдаёт сообщение “Бомба взорвалась”,
# а если не достиг, то программа вновь переспрашивает,
# не хочет ли игрок обезвредить бомбу, и сообщает, сколько времени осталось до взрыва..
#
# Если ответ “да”, то программа выводит на экран сообщение о том,
# что бомба обезврежена и сколько секунд оставалось до взрыва.
# Используйте цикл for.
for timer in range(60,0-1,-10):
  question = int(input("Хотите обезвредить бомбу? 1 - да, 0 - нет.:"))
  if question == 1:
    print("бомба обезвреженна")
    print("До взрыва оставалось", timer,"секунд")
    break
  else:
    print("До взрыва", timer)
    if timer <= 0:
      print("Буум")
