print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2
a = int(input("Введите 1-ю длину:"))
b = int(input("Введите 2-ю длину:"))
area = a / 2 + b / 2
print(area)
# Не уверенн, правильно ли я задачку понял =|
